
const TIANGAN = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];

const RELATIONS = ['贵神', '财神', '福神', '冲', '被冲'];

const TianganRelations = {
  '甲': { '贵神': '丁', '财神': '己', '福神': '辛', '冲': '戊', '被冲': '庚' },
  '乙': { '贵神': '戊', '财神': '庚', '福神': '壬', '冲': '己', '被冲': '辛' },
  '丙': { '贵神': '己', '财神': '辛', '福神': '癸', '冲': '庚', '被冲': '壬' },
  '丁': { '贵神': '庚', '财神': '壬', '福神': '甲', '冲': '辛', '被冲': '癸' },
  '戊': { '贵神': '辛', '财神': '癸', '福神': '乙', '冲': '壬', '被冲': '甲' },
  '己': { '贵神': '壬', '财神': '甲', '福神': '丙', '冲': '癸', '被冲': '乙' },
  '庚': { '贵神': '癸', '财神': '乙', '福神': '丁', '冲': '甲', '被冲': '丙' },
  '辛': { '贵神': '甲', '财神': '丙', '福神': '戊', '冲': '乙', '被冲': '丁' },
  '壬': { '贵神': '乙', '财神': '丁', '福神': '己', '冲': '丙', '被冲': '戊' },
  '癸': { '贵神': '丙', '财神': '戊', '福神': '庚', '冲': '丁', '被冲': '己' }
};

export { TIANGAN, RELATIONS, TianganRelations };

